tabs = {
    1: (99, 13),
    2: (217, 13),
    3: (335, 13),
}

"""
(x, y, RGB-off, RGB-on, label, window)
"""

sds3X_dict = {
    "ailerons_trim_n": (791, 287, (0, 0, 0), (0, 255, 0), "Нейтральное положение триммера элеронов", 3),
    "elevator_trim_n": (791, 329, (0, 0, 0), (0, 255, 0), "Нейтральное положение триммера РВ", 3),
    "rudder_trim_n": (791, 375, (0, 0, 0), (0, 255, 0), "Нейтральное положение триммера РН", 3),
    "engine_start": (548, 47, (0, 0, 0), (255, 255, 0), "Запуск двигателя", 3),
    "manual_mode": (938, 50, (0, 0, 0), (255, 255, 0), "Ручной режим", 3),
    "wow": None,  # Шасси обжато
    "apu_start": (550, 45, (0, 0, 0), (255, 255, 0), "ВСУ Запуск", 3),
    "apu_work": (644, 49, (0, 0, 0), (255, 255, 0), "ВСУ Работа", 3),
    "engine_fire": None,  # Пожар двигатель
    "apu_fire": None,  # ВСУ Пожар
    "engine_failure": None,  # Отказ двигателя
    "generator_fail": None,  # Отказ генератора
}

"""
((x-left-up, x-right-down), (y-left-up, y-right-down), label, type, values, module, window)
"""
arinc_dict = {
    "pitch": ((43, 54), (178, 196), "Угол тангажа", "int", (30, -90, 90), True, 1),
    "roll": ((143, 155), (178, 198), "Угол крена", "int", (0, 30, -180, 180), True, 1),
    "course_mag": None,
    "course_track_mag": None,
    "course_true": ((505, 519), (577, 591), "Истинный курс", "int", (0, 60, 359), False, 1),
    "course_gyro": None,
    "H_sns": ((783, 834), (352, 372), "высота СНС", "float", (300, 1000), False, 1),
}
