"""
(x, y, RGB-off, RGB-on, label)
"""

sds3X_dict = {
            "ailerons_trim_n": (791, 287, (0, 0, 0), (0, 255, 0), "Нейтральное положение триммера элеронов"),
            "elevator_trim_n": (791, 329, (0, 0, 0), (0, 255, 0), "Нейтральное положение триммера РВ"),
            "rudder_trim_n": (791, 375, (0, 0, 0), (0, 255, 0), "Нейтральное положение триммера РН"),
            "engine_start": (548, 47, (0, 0, 0), (255, 255, 0), "Запуск двигателя"),
            "manual_mode": (938, 50, (0, 0, 0), (255, 255, 0), "Ручной режим"),
            "wow": None,  # Шасси обжато
            "apu_start": (550, 45, (0, 0, 0), (255, 255, 0), "ВСУ Запуск"),
            "apu_work": (644, 49, (0, 0, 0), (255, 255, 0), "ВСУ Работа"),
            "engine_fire": None,  # Пожар двигатель
            "apu_fire": None,  # ВСУ Пожар
            "engine_failure": None,  # Отказ двигателя
            "generator_fail": None,  # Отказ генератора
}

"""
((x-left-up, x-right-down), (y-left-up, y-right-down), label, type, values)
"""
arinc_dict = {
    "pitch": (),
    "H_sns": ((783, 834), (352, 372), "высота СНС", "float", (300, 1000))
}